In [1]:
import requests
import PyPDF2  
import camelot

In [2]:
url = "https://nirfcdn.azureedge.net/2020/pdf/Engineering/IR-E-U-0456.pdf"

In [3]:
data=requests.get(url)

In [17]:
with open('IR-E-U-0456.pdf','wb') as f:
    f.write(data.content)

In [22]:
tables = camelot.read_pdf('IR-E-U-0456.pdf')

In [24]:
tables.n

3

In [84]:
table = tables[2].df

In [85]:
table

,0,1,2,3,4,5,6,7,8,9
0,Academic Year,No. of first year\nstudents intake in the\nyear,No. of first year\nstudents admitted in\nthe year,Academic Year,No. of students\nadmitted through\nLateral entry,Academic Year,No. of students\ngraduating in\nminimum stipul...,No. of students\nplaced,Median salary of\nplaced\ngraduates(Amount in\...,No. of students\nselected for Higher\nStudies
1,2013-14,446,439,2014-15,0,2016-17,437,288,1020000(Rupees Ten\nlakhs and Twenty\nthousand),102
2,2014-15,466,441,2015-16,0,2017-18,334,283,1306000(Rupees\nThirteen lakhs six\nthousand o...,51
3,2015-16,466,458,2016-17,0,2018-19,362,268,1360000(Rupees\nThirteen Lakhs Sixty\nthousand),65

'1360000'